// MQ2DamageParser by EqMule
//
// This plugin parse DPS directly from the hit function.
// No log file reading etc.
//
// 1.0 2017-01-01 Initial Release.
// 1.1 2018-12-12 Fixed a parsing bug due to a change in the client.
// 1.2 2019-01-01 Added TypeMember(Average) and TypeMember(TotalFightingTime)
// 1.3 2019-01-03 Added /dpsreset and /dpsaverage
// 1.4
/////////////////////////////////////////////////////////////////



#include "../MQ2Plugin.h"
#include <memory.h>
#include "resource.h"

using namespace std;
PreSetup("MQ2DamageParser");
PLUGIN_VERSION(1.3);
bool gBUsePerCharSettings = false;
bool gbShowLogWindow = false;
class CDamageParserLogWnd;
CDamageParserLogWnd *pDamageParserLogWnd=0;
RECT LogWindowLoc = { 100,330,710,550 };
void DPSAverage(PSPAWNINFO pLPlayer, char* szLine);
void DPSReset(PSPAWNINFO pLPlayer, char* szLine);
#define WSF_AUTOSTRETCHH	0x00400000
#define WSF_CLIENTMOVABLE	0x00200000
#define WSF_NOHITTEST		0x00008000
#define WSF_USEMYALPHA		0x00000800
#define WSF_TRANSPARENT		0x00000400
#define WSF_SIZABLE			0x00000200
#define WSF_AUTOSTRETCHV	0x00000100
#define WSF_RELATIVERECT	0x00000080
#define WSF_BORDER			0x00000040
#define WSF_MINIMIZEBOX     0x00000020
#define WSF_CLOSEBOX        0x00000008
#define WSF_TITLEBAR		0x00000004

class CDamageParserLogWnd : public CSidlScreenWnd
{
public:
    CDamageParserLogWnd(CXStr *screenpiece):CSidlScreenWnd(0,screenpiece,-1,1,0)
    {
        CreateChildrenFromSidl();
        pXWnd()->Show(gbShowLogWindow,0);
        ReplacevfTable();
        CloseOnESC=1;
    }
    CDamageParserLogWnd(char *screenpiece):CSidlScreenWnd(0,&CXStr(screenpiece),-1,1,0)
    {
        CreateChildrenFromSidl();
		pXWnd()->Show(gbShowLogWindow,0);
        ReplacevfTable();
        CloseOnESC=1;
		SetWndNotification(CDamageParserLogWnd);
		ResetButton = (CButtonWnd*)GetChildItem("DPLW_DPSResetButton");
		UpdateButton = (CButtonWnd*)GetChildItem("DPLW_DPSAvgButton");
		if (LogList = (CListWnd*)GetChildItem("DPLW_LogList"))
		{
			ARGBCOLOR col = { 0 };
			col.A = 255;
			col.R = 138;
			col.G = 163;
			col.B = 255;
			LogList->HeaderText = col.ARGB;
			//CRNormal
			col.R = 255;
			col.G = 255;
			col.B = 255;
			LogList->CRNormal = col.ARGB;
			//Highlight
			col.R = 255;
			col.G = 255;
			col.B = 0;
			LogList->Highlight = col.ARGB;
			//Selected
			col.R = 128;
			col.G = 128;
			col.B = 128;
			LogList->Selected = col.ARGB;;
			LogList->SetColumnsSizable(true);
			LogList->ListWndStyle |= 0x00040000;//SORT is ok...
			LogList->SortCol = 0;
			LogList->bSortAsc = false;
			LogList->SetColumnJustification(1,1);//center column 1
			LogList->SetColumnJustification(2,1);//center column 2
		}
		this->Faded = false;
		//this->ZLayer = 1;
		this->CloseOnESC = false;
		this->Clickable = true;
		this->Alpha = 0xfF;
		this->BGColor = 0xFF000000;
		this->BGType = 1;
		this->SetStyle(WSF_USEMYALPHA | WSF_SIZABLE | WSF_BORDER | WSF_MINIMIZEBOX | WSF_CLOSEBOX | WSF_TITLEBAR); 
    }

    ~CDamageParserLogWnd()
    {
        RemovevfTable();
    }
    int WndNotification(CXWnd *pWnd, unsigned int Message, void *pData)
    {    
		//UpdateButton
		if (Message == XWM_LMOUSEUP)
		{
			if (pWnd == (CXWnd*)UpdateButton)
			{
				DPSAverage((PSPAWNINFO)pLocalPlayer, "");
				return 1;
			}
			else if (pWnd == (CXWnd*)ResetButton)
			{
				DPSReset((PSPAWNINFO)pLocalPlayer, "");
				return 1;
			}
		}
		//check for sortrequest...
		else if (Message == XWM_COLUMNCLICK)
		{
			if (pWnd == (CXWnd*)LogList)
			{
				int colindex = (int)pData;
				if (colindex > 3)//we only have 3 columns...
					colindex = 3;
				int sortcol = LogList->SortCol;
				if (sortcol == colindex)
				{
					LogList->bSortAsc = !LogList->bSortAsc;
				}
				else
				{
					LogList->SortCol = colindex;
					LogList->bSortAsc = true;
				}
				LogList->Sort();
			}
		}
		else if (Message == XWM_SORTREQUEST)
		{
			if (pWnd == (CXWnd*)LogList)
			{
				SListWndSortInfo *SortInf = (SListWndSortInfo *)pData;
				switch(SortInf->SortCol)
				{
				case 0://time
					{
						//add sort code...
						/*SortInf->SortResult = strcmp( SortInf->StrLabel1, SortInf->StrLabel2 );
						if ( SortInf->SortResult == 0 && SortInf->ListWndLine1.Cells.GetLength() > 1 && SortInf->ListWndLine2.Cells.GetLength() > 1 )
						{
							//SortInf->SortResult = strcmp(SortInf->ListWndLine1.Cells[1].Text, SortInf->ListWndLine2.Cells[1].Text);
						}*/

					}
					break;
				case 1://seconds
					{
						//add sort code
					}
					break;
				}
			}
		}
		return CSidlScreenWnd::WndNotification(pWnd,Message,pData);
    }

    void ReplacevfTable()
    {
        OldvfTable=((_CSIDLWND*)this)->pvfTable;
        PCSIDLWNDVFTABLE NewvfTable=new CSIDLWNDVFTABLE;
        memcpy(NewvfTable,OldvfTable,sizeof(CSIDLWNDVFTABLE));
        ((_CSIDLWND*)this)->pvfTable=NewvfTable;
    }

    void RemovevfTable()
    {
        PCSIDLWNDVFTABLE NewvfTable=((_CSIDLWND*)this)->pvfTable;
        ((_CSIDLWND*)this)->pvfTable=OldvfTable;
        delete NewvfTable;
    }

    void SetvfTable(DWORD index, DWORD value)
    {
        DWORD* vtable=(DWORD*)((_CSIDLWND*)this)->pvfTable;
        vtable[index]=value;
    }
	VOID AddLogLine(__time64_t totalfighttime, __int64 dpsaverage, PCHAR szNote, ...)
	{
		if (!LogList)
			return;
		va_list vaList;
		va_start(vaList, szNote);
		int len = _vscprintf(szNote, vaList) + 1;// _vscprintf doesn't count // terminating '\0'  
		if (char *szOutput = (char *)LocalAlloc(LPTR, len + 32)) {
			vsprintf_s(szOutput, len, szNote, vaList);
			char tmpbuf[128] = { 0 };
			struct tm today = { 0 };
			time_t tm = { 0 };
			tm = time(NULL);
			localtime_s(&today, &tm);
			strftime(tmpbuf, 128, "%Y/%m/%d %H:%M:%S", &today);
			int id = LogList->AddString(tmpbuf, 0xFF00FF00, 0, 0);
			sprintf_s(tmpbuf, "%lld Seconds",totalfighttime);
			LogList->SetItemText(id, 1, &CXStr(tmpbuf));
			sprintf_s(tmpbuf, "%lld",dpsaverage);
			LogList->SetItemText(id, 2, &CXStr(tmpbuf));
			LogList->SetItemText(id, 3, &CXStr(szOutput));

			LocalFree(szOutput);
		}
	}
/*0x218*/   CListWnd   *LogList;
/*0x21c*/   CButtonWnd   *UpdateButton;
/*0x220*/   CButtonWnd   *ResetButton;
/*0x224*/	PCSIDLWNDVFTABLE OldvfTable;
};
bool bDisabledDamageParserLogWnd = false;
HANDLE ghLockMap = 0;
typedef struct _MYEQSuccessfulHit 
{
/*0x00*/ CHAR	DamagedName[0x40];
/*0x40*/ CHAR	AttackerName[0x40];
		 int DamagedID;
		 int AttackerID;
/*0x80*/ unsigned char	Skill;//1 HS etc...
/*0x84*/ int	SpellID;
/*0x88*/ int	DamageCaused;
/*0x8c*/ float	Force;
/*0x90*/ float	HitHeading;
/*0x94*/ float	HitPitch;
/*0x98*/ bool	bSecondary;
/*0x9c*/ int	SpecialCase;//origin of damage? need to investigate further -eqmule
/*0xa0*/ //added by me for time of dmg
bool bNPC;
__time64_t TimeStamp;
} MYEQSuccessfulHit, *pMyEQSuccessfulHit;
#pragma pack(push)
#pragma pack(1)
typedef struct _EQSuccessfulHit2
{
/*0x00*/ unsigned short	DamagedID;//Spawn that was hit
/*0x02*/ unsigned short	AttackerID;//spawn who did the hit
/*0x04*/ unsigned char	Skill;//1 HS etc...
/*0x08*/ int	SpellID;
/*0x0c*/ int	DamageCaused;
/*0x10*/ float	Force;
/*0x14*/ float	HitHeading;
/*0x18*/ float	HitPitch;
/*0x1c*/ bool	bSecondary;
/*0x20*/ int	SpecialCase;//origin of damage? need to investigate further -eqmule
/*0x24*/ 
} EQSuccessfulHit2, *pEQSuccessfulHit2;
#pragma pack(pop)
std::map<int, std::list<MYEQSuccessfulHit>>AccumulatedDamage;
void DPSReset(PSPAWNINFO pLPlayer, char* szLine)
{
	lockit lk(ghLockMap,"DPSReset");
	WriteChatf("Cleared the DPS map.");
	AccumulatedDamage.clear();
}
void AddToDamageMap(int ID, pMyEQSuccessfulHit hit)
{
	lockit lk(ghLockMap,"AddToDamageMap");
	AccumulatedDamage[ID].push_back(*hit);
}
bool GetDamageMap(std::map<int, std::list<MYEQSuccessfulHit>>&dmgmap)
{
	lockit lk(ghLockMap,"GetDamageMap");
	if (AccumulatedDamage.size())
	{
		dmgmap = AccumulatedDamage;
		return true;
	}
	return false;
}
size_t GetDamageMapSize()
{
	lockit lk(ghLockMap,"GetDamageMapSize");
	return AccumulatedDamage.size();
}
void ClearDamageMap()
{
	lockit lk(ghLockMap,"ClearDamageMap");
	AccumulatedDamage.clear();
}

class MyCEverQuest
{
public:

